#### Terraform Plan (Prod) 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_project.project: Reading...
google_project_service.iamcredentials_api: Refreshing state... [id=calendarsync-napier/iamcredentials.googleapis.com]
google_project_service.cloudbuild_api: Refreshing state... [id=calendarsync-napier/cloudbuild.googleapis.com]
google_service_account.app_runner: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/app-runner@calendarsync-napier.iam.gserviceaccount.com]
google_service_account.scheduler_invoker: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com]
google_project_service.run_api: Refreshing state... [id=calendarsync-napier/run.googleapis.com]
google_project_service.cloudscheduler_api: Refreshing state... [id=calendarsync-napier/cloudscheduler.googleapis.com]
google_project_service.serviceusage_api: Refreshing state... [id=calendarsync-napier/serviceusage.googleapis.com]
google_project_service.firestore_api: Refreshing state... [id=calendarsync-napier/firestore.googleapis.com]
google_project_service.calendar_api: Refreshing state... [id=calendarsync-napier/calendar-json.googleapis.com]
google_project_service.iam_api: Refreshing state... [id=calendarsync-napier/iam.googleapis.com]
google_project_service.tasks_api: Refreshing state... [id=calendarsync-napier/cloudtasks.googleapis.com]
data.google_project.project: Read complete after 1s [id=projects/calendarsync-napier]
google_project_service.secretmanager_api: Refreshing state... [id=calendarsync-napier/secretmanager.googleapis.com]
google_project_service.cloudresourcemanager_api: Refreshing state... [id=calendarsync-napier/cloudresourcemanager.googleapis.com]
google_project_iam_member.app_runner_firestore: Refreshing state... [id=calendarsync-napier/roles/datastore.user/serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.app_runner_logging: Refreshing state... [id=calendarsync-napier/roles/logging.logWriter/serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com]
google_project_service.artifact_registry_api: Refreshing state... [id=calendarsync-napier/artifactregistry.googleapis.com]
google_service_account.github_actions: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_tasks_enqueuer: Refreshing state... [id=calendarsync-napier/roles/cloudtasks.enqueuer/serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com]
google_iam_workload_identity_pool.github_pool: Refreshing state... [id=projects/calendarsync-napier/locations/global/workloadIdentityPools/github-pool]
google_service_account_iam_member.scheduler_impersonation_runner: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.app_runner_secrets: Refreshing state... [id=calendarsync-napier/roles/secretmanager.secretAccessor/serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.cloudbuild_run_admin: Refreshing state... [id=calendarsync-napier/roles/run.admin/serviceAccount:179450231286@cloudbuild.gserviceaccount.com]
google_project_service.identitytoolkit_api: Refreshing state... [id=calendarsync-napier/identitytoolkit.googleapis.com]
google_firestore_database.default: Refreshing state... [id=projects/calendarsync-napier/databases/(default)]
google_cloud_tasks_queue.sync_queue: Refreshing state... [id=projects/calendarsync-napier/locations/us-central1/queues/sync-queue]
google_project_service_identity.cloud_scheduler: Refreshing state... [id=projects/calendarsync-napier/services/cloudscheduler.googleapis.com]
google_project_service.firebase_api: Refreshing state... [id=calendarsync-napier/firebase.googleapis.com]
google_project_iam_member.github_actions_wif_admin: Refreshing state... [id=calendarsync-napier/roles/iam.workloadIdentityPoolAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_sa_admin: Refreshing state... [id=calendarsync-napier/roles/iam.serviceAccountAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_service_usage: Refreshing state... [id=calendarsync-napier/roles/serviceusage.serviceUsageAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_sa_user: Refreshing state... [id=calendarsync-napier/roles/iam.serviceAccountUser/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_iam_admin: Refreshing state... [id=calendarsync-napier/roles/resourcemanager.projectIamAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_artifact_registry: Refreshing state... [id=calendarsync-napier/roles/artifactregistry.writer/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_run_admin: Refreshing state... [id=calendarsync-napier/roles/run.admin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_editor: Refreshing state... [id=calendarsync-napier/roles/editor/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_service_account_iam_member.scheduler_impersonation: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:service-179450231286@gcp-sa-cloudscheduler.iam.gserviceaccount.com]
google_service_account_iam_member.github_actions_wif_user: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/github-actions-sa@calendarsync-napier.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/179450231286/locations/global/workloadIdentityPools/github-pool/attribute.repository/billnapier/calendarsync]
google_iam_workload_identity_pool_provider.github_provider: Refreshing state... [id=projects/calendarsync-napier/locations/global/workloadIdentityPools/github-pool/providers/github-provider]
google_firebase_project.default: Refreshing state... [id=projects/calendarsync-napier]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/calendarsync-napier/locations/us-central1/repositories/python-cloudrun-app]
google_firebase_web_app.default: Refreshing state... [id=projects/calendarsync-napier/webApps/1:179450231286:web:062abd3c40b3b6a3abefd7]
data.google_firebase_web_app_config.default: Reading...
google_firebase_hosting_custom_domain.default: Refreshing state... [id=projects/calendarsync-napier/sites/calendarsync-napier/customDomains/calendarsync.billnapier.com]
data.google_firebase_web_app_config.default: Read complete after 0s [id=1:179450231286:web:062abd3c40b3b6a3abefd7]
google_cloud_run_service.default: Refreshing state... [id=locations/us-central1/namespaces/calendarsync-napier/services/python-cloudrun-app]
google_cloud_run_service_iam_member.scheduler_invoker: Refreshing state... [id=v1/projects/calendarsync-napier/locations/us-central1/services/python-cloudrun-app/roles/run.invoker/serviceAccount:scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.public_access: Refreshing state... [id=v1/projects/calendarsync-napier/locations/us-central1/services/python-cloudrun-app/roles/run.invoker/allUsers]
google_cloud_scheduler_job.sync_all: Refreshing state... [id=projects/calendarsync-napier/locations/us-central1/jobs/sync-all-users]
google_identity_platform_config.default: Refreshing state... [id=projects/calendarsync-napier/config]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_service.default has changed
  ~ resource "google_cloud_run_service" "default" {
        id                         = "locations/us-central1/namespaces/calendarsync-napier/services/python-cloudrun-app"
        name                       = "python-cloudrun-app"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "python-cloudrun-app-00102-rdl" -> "python-cloudrun-app-00114-b8n"
              ~ latest_ready_revision_name   = "python-cloudrun-app-00102-rdl" -> "python-cloudrun-app-00114-b8n"
              ~ observed_generation          = 102 -> 114
              ~ traffic                      = [
                  ~ {
                      ~ revision_name   = "python-cloudrun-app-00102-rdl" -> "python-cloudrun-app-00114-b8n"
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (2 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_identity_platform_config.default will be updated in-place
  ~ resource "google_identity_platform_config" "default" {
        id                         = "projects/calendarsync-napier/config"
        name                       = "projects/179450231286/config"
        # (3 unchanged attributes hidden)

      - multi_tenant {
          - allow_tenants           = false -> null
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # google_monitoring_alert_policy.cron_absence will be created
  + resource "google_monitoring_alert_policy" "cron_absence" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "CalendarSync Cron Job Down"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "calendarsync-napier"

      + conditions {
          + display_name = "No trigger from Cloud Scheduler in 2 hours"
          + name         = (known after apply)

          + condition_absent {
              + duration = "7200s"
              + filter   = "resource.type = \"cloud_scheduler_job\" AND resource.labels.job_id = \"sync-all-users\" AND metric.type = \"cloudscheduler.googleapis.com/job/attempt_execution_count\""

              + aggregations {
                  + alignment_period     = "3600s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + per_series_aligner   = "ALIGN_COUNT"
                }
            }
        }
    }

  # google_monitoring_alert_policy.cron_errors will be created
  + resource "google_monitoring_alert_policy" "cron_errors" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "CalendarSync Cron Task Failures"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "calendarsync-napier"

      + conditions {
          + display_name = "High failed sync tasks"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type = \"cloud_tasks_queue\" AND resource.labels.queue_id = \"sync-queue\" AND metric.type = \"cloudtasks.googleapis.com/queue/task_attempt_count\" AND metric.labels.response_code != \"OK\""
              + threshold_value = 5

              + aggregations {
                  + alignment_period     = "300s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + per_series_aligner   = "ALIGN_RATE"
                }
            }
        }
    }

  # google_monitoring_alert_policy.ui_errors will be created
  + resource "google_monitoring_alert_policy" "ui_errors" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "CalendarSync UI High 5xx Error Rate"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "calendarsync-napier"

      + conditions {
          + display_name = "Cloud Run 5xx Errors > 5%"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type = \"cloud_run_revision\" AND resource.labels.service_name = \"python-cloudrun-app\" AND metric.type = \"run.googleapis.com/request_count\" AND metric.labels.response_code_class = \"5xx\" AND resource.labels.configuration_name != \"SYNC_ONE\""
              + threshold_value = 5

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + per_series_aligner   = "ALIGN_RATE"
                }
            }
        }
    }

  # google_monitoring_dashboard.calendarsync_dashboard will be created
  + resource "google_monitoring_dashboard" "calendarsync_dashboard" {
      + dashboard_json = jsonencode(
            {
              + displayName = "CalendarSync Observability"
              + gridLayout  = {
                  + columns = "2"
                  + widgets = [
                      + {
                          + title   = "Cloud Run Requests (All vs 5xx)"
                          + xyChart = {
                              + dataSets = [
                                  + {
                                      + plotType        = "LINE"
                                      + timeSeriesQuery = {
                                          + timeSeriesFilter = {
                                              + aggregation = {
                                                  + alignmentPeriod    = "60s"
                                                  + crossSeriesReducer = "REDUCE_SUM"
                                                  + perSeriesAligner   = "ALIGN_RATE"
                                                }
                                              + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"python-cloudrun-app\" AND metric.type=\"run.googleapis.com/request_count\" AND metric.labels.response_code_class=\"2xx\""
                                            }
                                        }
                                    },
                                  + {
                                      + plotType        = "LINE"
                                      + timeSeriesQuery = {
                                          + timeSeriesFilter = {
                                              + aggregation = {
                                                  + alignmentPeriod    = "60s"
                                                  + crossSeriesReducer = "REDUCE_SUM"
                                                  + perSeriesAligner   = "ALIGN_RATE"
                                                }
                                              + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"python-cloudrun-app\" AND metric.type=\"run.googleapis.com/request_count\" AND metric.labels.response_code_class=\"5xx\""
                                            }
                                        }
                                    },
                                ]
                            }
                        },
                      + {
                          + title   = "Cloud Tasks Attempts (Success vs Failure)"
                          + xyChart = {
                              + dataSets = [
                                  + {
                                      + plotType        = "LINE"
                                      + timeSeriesQuery = {
                                          + timeSeriesFilter = {
                                              + aggregation = {
                                                  + alignmentPeriod    = "60s"
                                                  + crossSeriesReducer = "REDUCE_SUM"
                                                  + perSeriesAligner   = "ALIGN_RATE"
                                                }
                                              + filter      = "metric.type=\"cloudtasks.googleapis.com/queue/task_attempt_count\" AND resource.type=\"cloud_tasks_queue\" AND resource.labels.queue_id=\"sync-queue\" AND metric.labels.response_code=\"OK\""
                                            }
                                        }
                                    },
                                  + {
                                      + plotType        = "LINE"
                                      + timeSeriesQuery = {
                                          + timeSeriesFilter = {
                                              + aggregation = {
                                                  + alignmentPeriod    = "60s"
                                                  + crossSeriesReducer = "REDUCE_SUM"
                                                  + perSeriesAligner   = "ALIGN_RATE"
                                                }
                                              + filter      = "metric.type=\"cloudtasks.googleapis.com/queue/task_attempt_count\" AND resource.type=\"cloud_tasks_queue\" AND resource.labels.queue_id=\"sync-queue\" AND metric.labels.response_code!=\"OK\""
                                            }
                                        }
                                    },
                                ]
                            }
                        },
                      + {
                          + logsPanel = {
                              + filter = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"python-cloudrun-app\" AND textPayload:\"SYNC_STATS:\""
                            }
                          + title     = "Sync Completed Structured Logs"
                        },
                      + {
                          + logsPanel = {
                              + filter = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"python-cloudrun-app\" AND textPayload:\"SYNC_ERROR:\""
                            }
                          + title     = "Sync Failure Structured Logs"
                        },
                    ]
                }
            }
        )
      + id             = (known after apply)
      + project        = "calendarsync-napier"
    }

  # google_monitoring_notification_channel.email_alert will be created
  + resource "google_monitoring_notification_channel" "email_alert" {
      + display_name        = "Email Alert Channel"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "billnapier@gmail.com"
        }
      + name                = (known after apply)
      + project             = "calendarsync-napier"
      + type                = "email"
      + verification_status = (known after apply)
    }

  # google_project_service.monitoring_api will be created
  + resource "google_project_service" "monitoring_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "calendarsync-napier"
      + service            = "monitoring.googleapis.com"
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @billnapier, Action: `pull_request`*